; domain
(define (domain delivery)
  (:requirements :strips :typing) 
  (:types carrier
          agent - vehicle
          crate
          vehicle - physobj
          base
          location - place
          city
          place 
          physobj - object)
  
  (:predicates 	(in-city ?p - place ?city - city) ; person in the city
		(at ?obj - physobj ?loc - place)
		(in ?pkg - crate ?veh - vehicle))
  
(:action LOAD-CARRIER
   :parameters    (?pkg - crate ?carrier - carrier ?loc - place)
   :precondition  (and (at ?carrier ?loc) (at ?pkg ?loc))
   :effect        (and (not (at ?pkg ?loc)) (in ?pkg ?carrier)))

(:action LOAD-AGENT
  :parameters   (?pkg - crate ?agent - agent ?loc - place)
  :precondition (and (at ?pkg ?loc) (at ?agent ?loc))
  :effect       (and (not (at ?pkg ?loc)) (in ?pkg ?agent)))

(:action UNLOAD-CARRIER
  :parameters   (?pkg - crate ?carrier - carrier ?loc - place)
  :precondition (and (at ?carrier ?loc) (in ?pkg ?carrier))
  :effect       (and (not (in ?pkg ?carrier)) (at ?pkg ?loc)))

(:action UNLOAD-AGENT
  :parameters    (?pkg - crate ?agent - agent ?loc - place)
  :precondition  (and (in ?pkg ?agent) (at ?agent ?loc))
  :effect        (and (not (in ?pkg ?agent)) (at ?pkg ?loc)))

(:action MOVE-CARRIER
  :parameters (?carrier - carrier ?loc-from - place ?loc-to - place ?city - city)
  :precondition
   (and (at ?carrier ?loc-from) (in-city ?loc-from ?city) (in-city ?loc-to ?city))
  :effect
   (and (not (at ?carrier ?loc-from)) (at ?carrier ?loc-to)))

(:action FLY-AGENT
  :parameters (?agent - agent ?loc-from - base ?loc-to - base)
  :precondition
   (at ?agent ?loc-from)
  :effect
   (and (not (at ?agent ?loc-from)) (at ?agent ?loc-to)))
)

; problem
(define (problem delivery-prob-1)
    (:domain delivery)
    (:objects
          apn2 apn1 - agent
          
          apt5 apt4 apt3 apt2 apt1 - base
          
          depot pos5 pos4 pos3 pos2 pos1 - location
          
          cit5 cit4 cit3 cit2 cit1 - city
          
          c5 c4 c3 c2 c1 - carrier
          
          food_1 food_2 food_3 food_4 food_5 food_6 food_7 food_8
          med_1 med_2 med_3 med_4 med_5 med_6 med_7 med_8 - crate
    )
    (:init  (at apn1 apt2) (at apn2 apt1) (at c1 pos1) 
            (at food_1 depot) (at food_2 depot) (at food_3 depot) (at food_4 depot) 
            (at food_5 depot) (at food_6 depot) (at food_7 depot) (at food_8 depot)
            (at med_1 depot) (at med_2 depot) (at med_3 depot) (at med_4 depot) 
            (at med_5 depot) (at med_6 depot) (at med_7 depot) (at med_8 depot)
            (at c2 pos2) (at c3 pos3) (at c4 pos4) (at c5 pos5)

            (in-city pos1 cit1)
            (in-city depot cit1)(in-city apt1 cit1) (in-city pos2 cit2) (in-city apt2 cit2) (in-city pos3 cit3)
            (in-city apt3 cit3) (in-city pos4 cit4) (in-city apt4 cit4) (in-city pos5 cit5)
            (in-city apt5 cit5)
    )

    (:goal  (and 
                (at food_1 pos1) (at food_2 pos1) (at food_3 pos2) (at food_4 pos3) (at food_5 pos3) 
                (at food_6 pos4) (at food_7 pos4) (at food_8 pos5)
                (at med_1 pos1) (at med_2 pos2) (at med_3 pos2) (at med_4 pos3) (at med_5 pos4) 
                (at med_6 pos5) (at med_7 pos5) (at med_8 pos4)
                )
    )
)

; plan
1. (fly-agent apn2 apt1 apt3)
   deleted: (at apn2 apt1)
   added: (at apn2 apt3)
   goals met: 0 of 16
2. (fly-agent apn1 apt2 apt1)
   deleted: (at apn1 apt2)
   added: (at apn1 apt1)
   goals met: 0 of 16
3. (fly-agent apn2 apt3 apt4)
   deleted: (at apn2 apt3)
   added: (at apn2 apt4)
   goals met: 0 of 16
4. (fly-agent apn2 apt4 apt5)
   deleted: (at apn2 apt4)
   added: (at apn2 apt5)
   goals met: 0 of 16
5. (move-carrier c1 pos1 depot cit1)
   deleted: (at c1 pos1)
   added: (at c1 depot)
   goals met: 0 of 16
6. (load-carrier food_1 c1 depot)
   deleted: (at food_1 depot)
   added: (in food_1 c1)
   goals met: 0 of 16
7. (move-carrier c1 depot apt1 cit1)
   deleted: (at c1 depot)
   added: (at c1 apt1)
   goals met: 0 of 16
8. (move-carrier c5 pos5 apt5 cit5)
   deleted: (at c5 pos5)
   added: (at c5 apt5)
   goals met: 0 of 16
9. (move-carrier c4 pos4 apt4 cit4)
   deleted: (at c4 pos4)
   added: (at c4 apt4)
   goals met: 0 of 16
10. (move-carrier c3 pos3 apt3 cit3)
   deleted: (at c3 pos3)
   added: (at c3 apt3)
   goals met: 0 of 16
11. (move-carrier c2 pos2 apt2 cit2)
   deleted: (at c2 pos2)
   added: (at c2 apt2)
   goals met: 0 of 16
12. (move-carrier c1 apt1 pos1 cit1)
   deleted: (at c1 apt1)
   added: (at c1 pos1)
   goals met: 0 of 16
13. (unload-carrier food_1 c1 pos1)
   deleted: (in food_1 c1)
   added: (at food_1 pos1)
   goals met: 1 of 16
14. (fly-agent apn1 apt1 apt2)
   deleted: (at apn1 apt1)
   added: (at apn1 apt2)
   goals met: 1 of 16
15. (fly-agent apn1 apt2 apt3)
   deleted: (at apn1 apt2)
   added: (at apn1 apt3)
   goals met: 1 of 16
16. (fly-agent apn1 apt3 apt4)
   deleted: (at apn1 apt3)
   added: (at apn1 apt4)
   goals met: 1 of 16
17. (fly-agent apn2 apt5 apt1)
   deleted: (at apn2 apt5)
   added: (at apn2 apt1)
   goals met: 1 of 16
18. (move-carrier c1 pos1 depot cit1)
   deleted: (at c1 pos1)
   added: (at c1 depot)
   goals met: 1 of 16
19. (load-carrier food_2 c1 depot)
   deleted: (at food_2 depot)
   added: (in food_2 c1)
   goals met: 1 of 16
20. (move-carrier c1 depot apt1 cit1)
   deleted: (at c1 depot)
   added: (at c1 apt1)
   goals met: 1 of 16
21. (move-carrier c2 apt2 pos2 cit2)
   deleted: (at c2 apt2)
   added: (at c2 pos2)
   goals met: 1 of 16
22. (move-carrier c3 apt3 pos3 cit3)
   deleted: (at c3 apt3)
   added: (at c3 pos3)
   goals met: 1 of 16
23. (move-carrier c4 apt4 pos4 cit4)
   deleted: (at c4 apt4)
   added: (at c4 pos4)
   goals met: 1 of 16
24. (move-carrier c5 apt5 pos5 cit5)
   deleted: (at c5 apt5)
   added: (at c5 pos5)
   goals met: 1 of 16
25. (move-carrier c1 apt1 pos1 cit1)
   deleted: (at c1 apt1)
   added: (at c1 pos1)
   goals met: 1 of 16
26. (unload-carrier food_2 c1 pos1)
   deleted: (in food_2 c1)
   added: (at food_2 pos1)
   goals met: 2 of 16
27. (fly-agent apn2 apt1 apt2)
   deleted: (at apn2 apt1)
   added: (at apn2 apt2)
   goals met: 2 of 16
28. (fly-agent apn1 apt4 apt1)
   deleted: (at apn1 apt4)
   added: (at apn1 apt1)
   goals met: 2 of 16
29. (fly-agent apn2 apt2 apt3)
   deleted: (at apn2 apt2)
   added: (at apn2 apt3)
   goals met: 2 of 16
30. (fly-agent apn2 apt3 apt5)
   deleted: (at apn2 apt3)
   added: (at apn2 apt5)
   goals met: 2 of 16
31. (move-carrier c1 pos1 depot cit1)
   deleted: (at c1 pos1)
   added: (at c1 depot)
   goals met: 2 of 16
32. (load-carrier food_3 c1 depot)
   deleted: (at food_3 depot)
   added: (in food_3 c1)
   goals met: 2 of 16
33. (load-carrier food_4 c1 depot)
   deleted: (at food_4 depot)
   added: (in food_4 c1)
   goals met: 2 of 16
34. (load-carrier food_5 c1 depot)
   deleted: (at food_5 depot)
   added: (in food_5 c1)
   goals met: 2 of 16
35. (load-carrier food_6 c1 depot)
   deleted: (at food_6 depot)
   added: (in food_6 c1)
   goals met: 2 of 16
36. (load-carrier food_7 c1 depot)
   deleted: (at food_7 depot)
   added: (in food_7 c1)
   goals met: 2 of 16
37. (load-carrier food_8 c1 depot)
   deleted: (at food_8 depot)
   added: (in food_8 c1)
   goals met: 2 of 16
38. (load-carrier med_1 c1 depot)
   deleted: (at med_1 depot)
   added: (in med_1 c1)
   goals met: 2 of 16
39. (move-carrier c1 depot apt1 cit1)
   deleted: (at c1 depot)
   added: (at c1 apt1)
   goals met: 2 of 16
40. (unload-carrier food_8 c1 apt1)
   deleted: (in food_8 c1)
   added: (at food_8 apt1)
   goals met: 2 of 16
41. (unload-carrier food_7 c1 apt1)
   deleted: (in food_7 c1)
   added: (at food_7 apt1)
   goals met: 2 of 16
42. (load-agent food_7 apn1 apt1)
   deleted: (at food_7 apt1)
   added: (in food_7 apn1)
   goals met: 2 of 16
43. (unload-carrier food_6 c1 apt1)
   deleted: (in food_6 c1)
   added: (at food_6 apt1)
   goals met: 2 of 16
44. (load-agent food_6 apn1 apt1)
   deleted: (at food_6 apt1)
   added: (in food_6 apn1)
   goals met: 2 of 16
45. (unload-carrier food_5 c1 apt1)
   deleted: (in food_5 c1)
   added: (at food_5 apt1)
   goals met: 2 of 16
46. (unload-carrier food_4 c1 apt1)
   deleted: (in food_4 c1)
   added: (at food_4 apt1)
   goals met: 2 of 16
47. (unload-carrier food_3 c1 apt1)
   deleted: (in food_3 c1)
   added: (at food_3 apt1)
   goals met: 2 of 16
48. (move-carrier c5 pos5 apt5 cit5)
   deleted: (at c5 pos5)
   added: (at c5 apt5)
   goals met: 2 of 16
49. (move-carrier c4 pos4 apt4 cit4)
   deleted: (at c4 pos4)
   added: (at c4 apt4)
   goals met: 2 of 16
50. (move-carrier c3 pos3 apt3 cit3)
   deleted: (at c3 pos3)
   added: (at c3 apt3)
   goals met: 2 of 16
51. (move-carrier c2 pos2 apt2 cit2)
   deleted: (at c2 pos2)
   added: (at c2 apt2)
   goals met: 2 of 16
52. (move-carrier c1 apt1 pos1 cit1)
   deleted: (at c1 apt1)
   added: (at c1 pos1)
   goals met: 2 of 16
53. (unload-carrier med_1 c1 pos1)
   deleted: (in med_1 c1)
   added: (at med_1 pos1)
   goals met: 3 of 16
54. (fly-agent apn1 apt1 apt2)
   deleted: (at apn1 apt1)
   added: (at apn1 apt2)
   goals met: 3 of 16
55. (fly-agent apn1 apt2 apt3)
   deleted: (at apn1 apt2)
   added: (at apn1 apt3)
   goals met: 3 of 16
56. (fly-agent apn1 apt3 apt4)
   deleted: (at apn1 apt3)
   added: (at apn1 apt4)
   goals met: 3 of 16
57. (unload-agent food_7 apn1 apt4)
   deleted: (in food_7 apn1)
   added: (at food_7 apt4)
   goals met: 3 of 16
58. (unload-agent food_6 apn1 apt4)
   deleted: (in food_6 apn1)
   added: (at food_6 apt4)
   goals met: 3 of 16
59. (fly-agent apn2 apt5 apt1)
   deleted: (at apn2 apt5)
   added: (at apn2 apt1)
   goals met: 3 of 16
60. (load-agent food_8 apn2 apt1)
   deleted: (at food_8 apt1)
   added: (in food_8 apn2)
   goals met: 3 of 16
61. (move-carrier c1 pos1 depot cit1)
   deleted: (at c1 pos1)
   added: (at c1 depot)
   goals met: 3 of 16
62. (move-carrier c1 depot apt1 cit1)
   deleted: (at c1 depot)
   added: (at c1 apt1)
   goals met: 3 of 16
63. (move-carrier c2 apt2 pos2 cit2)
   deleted: (at c2 apt2)
   added: (at c2 pos2)
   goals met: 3 of 16
64. (move-carrier c3 apt3 pos3 cit3)
   deleted: (at c3 apt3)
   added: (at c3 pos3)
   goals met: 3 of 16
65. (load-carrier food_7 c4 apt4)
   deleted: (at food_7 apt4)
   added: (in food_7 c4)
   goals met: 3 of 16
66. (move-carrier c4 apt4 pos4 cit4)
   deleted: (at c4 apt4)
   added: (at c4 pos4)
   goals met: 3 of 16
67. (unload-carrier food_7 c4 pos4)
   deleted: (in food_7 c4)
   added: (at food_7 pos4)
   goals met: 4 of 16
68. (fly-agent apn2 apt1 apt2)
   deleted: (at apn2 apt1)
   added: (at apn2 apt2)
   goals met: 4 of 16
69. (fly-agent apn1 apt4 apt1)
   deleted: (at apn1 apt4)
   added: (at apn1 apt1)
   goals met: 4 of 16
70. (fly-agent apn2 apt2 apt3)
   deleted: (at apn2 apt2)
   added: (at apn2 apt3)
   goals met: 4 of 16
71. (fly-agent apn2 apt3 apt5)
   deleted: (at apn2 apt3)
   added: (at apn2 apt5)
   goals met: 4 of 16
72. (unload-agent food_8 apn2 apt5)
   deleted: (in food_8 apn2)
   added: (at food_8 apt5)
   goals met: 4 of 16
73. (move-carrier c1 apt1 depot cit1)
   deleted: (at c1 apt1)
   added: (at c1 depot)
   goals met: 4 of 16
74. (load-carrier med_2 c1 depot)
   deleted: (at med_2 depot)
   added: (in med_2 c1)
   goals met: 4 of 16
75. (load-carrier med_3 c1 depot)
   deleted: (at med_3 depot)
   added: (in med_3 c1)
   goals met: 4 of 16
76. (load-carrier med_4 c1 depot)
   deleted: (at med_4 depot)
   added: (in med_4 c1)
   goals met: 4 of 16
77. (load-carrier med_5 c1 depot)
   deleted: (at med_5 depot)
   added: (in med_5 c1)
   goals met: 4 of 16
78. (load-carrier med_6 c1 depot)
   deleted: (at med_6 depot)
   added: (in med_6 c1)
   goals met: 4 of 16
79. (load-carrier med_7 c1 depot)
   deleted: (at med_7 depot)
   added: (in med_7 c1)
   goals met: 4 of 16
80. (load-carrier med_8 c1 depot)
   deleted: (at med_8 depot)
   added: (in med_8 c1)
   goals met: 4 of 16
81. (move-carrier c4 pos4 apt4 cit4)
   deleted: (at c4 pos4)
   added: (at c4 apt4)
   goals met: 4 of 16
82. (move-carrier c3 pos3 apt3 cit3)
   deleted: (at c3 pos3)
   added: (at c3 apt3)
   goals met: 4 of 16
83. (move-carrier c2 pos2 apt2 cit2)
   deleted: (at c2 pos2)
   added: (at c2 apt2)
   goals met: 4 of 16
84. (load-carrier food_8 c5 apt5)
   deleted: (at food_8 apt5)
   added: (in food_8 c5)
   goals met: 4 of 16
85. (move-carrier c5 apt5 pos5 cit5)
   deleted: (at c5 apt5)
   added: (at c5 pos5)
   goals met: 4 of 16
86. (unload-carrier food_8 c5 pos5)
   deleted: (in food_8 c5)
   added: (at food_8 pos5)
   goals met: 5 of 16
87. (load-agent food_5 apn1 apt1)
   deleted: (at food_5 apt1)
   added: (in food_5 apn1)
   goals met: 5 of 16
88. (load-agent food_4 apn1 apt1)
   deleted: (at food_4 apt1)
   added: (in food_4 apn1)
   goals met: 5 of 16
89. (fly-agent apn1 apt1 apt2)
   deleted: (at apn1 apt1)
   added: (at apn1 apt2)
   goals met: 5 of 16
90. (fly-agent apn1 apt2 apt3)
   deleted: (at apn1 apt2)
   added: (at apn1 apt3)
   goals met: 5 of 16
91. (unload-agent food_4 apn1 apt3)
   deleted: (in food_4 apn1)
   added: (at food_4 apt3)
   goals met: 5 of 16
92. (fly-agent apn1 apt3 apt4)
   deleted: (at apn1 apt3)
   added: (at apn1 apt4)
   goals met: 5 of 16
93. (fly-agent apn2 apt5 apt1)
   deleted: (at apn2 apt5)
   added: (at apn2 apt1)
   goals met: 5 of 16
94. (load-carrier food_4 c3 apt3)
   deleted: (at food_4 apt3)
   added: (in food_4 c3)
   goals met: 5 of 16
95. (move-carrier c5 pos5 apt5 cit5)
   deleted: (at c5 pos5)
   added: (at c5 apt5)
   goals met: 5 of 16
96. (move-carrier c2 apt2 pos2 cit2)
   deleted: (at c2 apt2)
   added: (at c2 pos2)
   goals met: 5 of 16
97. (move-carrier c3 apt3 pos3 cit3)
   deleted: (at c3 apt3)
   added: (at c3 pos3)
   goals met: 5 of 16
98. (unload-carrier food_4 c3 pos3)
   deleted: (in food_4 c3)
   added: (at food_4 pos3)
   goals met: 6 of 16
99. (fly-agent apn2 apt1 apt2)
   deleted: (at apn2 apt1)
   added: (at apn2 apt2)
   goals met: 6 of 16
100. (fly-agent apn1 apt4 apt1)
   deleted: (at apn1 apt4)
   added: (at apn1 apt1)
   goals met: 6 of 16
101. (fly-agent apn1 apt1 apt3)
   deleted: (at apn1 apt1)
   added: (at apn1 apt3)
   goals met: 6 of 16
102. (unload-agent food_5 apn1 apt3)
   deleted: (in food_5 apn1)
   added: (at food_5 apt3)
   goals met: 6 of 16
103. (fly-agent apn2 apt2 apt3)
   deleted: (at apn2 apt2)
   added: (at apn2 apt3)
   goals met: 6 of 16
104. (fly-agent apn2 apt3 apt5)
   deleted: (at apn2 apt3)
   added: (at apn2 apt5)
   goals met: 6 of 16
105. (move-carrier c1 depot apt1 cit1)
   deleted: (at c1 depot)
   added: (at c1 apt1)
   goals met: 6 of 16
106. (unload-carrier med_8 c1 apt1)
   deleted: (in med_8 c1)
   added: (at med_8 apt1)
   goals met: 6 of 16
107. (unload-carrier med_7 c1 apt1)
   deleted: (in med_7 c1)
   added: (at med_7 apt1)
   goals met: 6 of 16
108. (unload-carrier med_6 c1 apt1)
   deleted: (in med_6 c1)
   added: (at med_6 apt1)
   goals met: 6 of 16
109. (unload-carrier med_5 c1 apt1)
   deleted: (in med_5 c1)
   added: (at med_5 apt1)
   goals met: 6 of 16
110. (unload-carrier med_4 c1 apt1)
   deleted: (in med_4 c1)
   added: (at med_4 apt1)
   goals met: 6 of 16
111. (unload-carrier med_3 c1 apt1)
   deleted: (in med_3 c1)
   added: (at med_3 apt1)
   goals met: 6 of 16
112. (unload-carrier med_2 c1 apt1)
   deleted: (in med_2 c1)
   added: (at med_2 apt1)
   goals met: 6 of 16
113. (move-carrier c3 pos3 apt3 cit3)
   deleted: (at c3 pos3)
   added: (at c3 apt3)
   goals met: 6 of 16
114. (move-carrier c2 pos2 apt2 cit2)
   deleted: (at c2 pos2)
   added: (at c2 apt2)
   goals met: 6 of 16
115. (load-carrier food_5 c3 apt3)
   deleted: (at food_5 apt3)
   added: (in food_5 c3)
   goals met: 6 of 16
116. (load-carrier food_6 c4 apt4)
   deleted: (at food_6 apt4)
   added: (in food_6 c4)
   goals met: 6 of 16
117. (move-carrier c4 apt4 pos4 cit4)
   deleted: (at c4 apt4)
   added: (at c4 pos4)
   goals met: 6 of 16
118. (unload-carrier food_6 c4 pos4)
   deleted: (in food_6 c4)
   added: (at food_6 pos4)
   goals met: 7 of 16
119. (move-carrier c3 apt3 pos3 cit3)
   deleted: (at c3 apt3)
   added: (at c3 pos3)
   goals met: 7 of 16
120. (unload-carrier food_5 c3 pos3)
   deleted: (in food_5 c3)
   added: (at food_5 pos3)
   goals met: 8 of 16
121. (fly-agent apn1 apt3 apt1)
   deleted: (at apn1 apt3)
   added: (at apn1 apt1)
   goals met: 8 of 16
122. (load-agent med_8 apn1 apt1)
   deleted: (at med_8 apt1)
   added: (in med_8 apn1)
   goals met: 8 of 16
123. (load-agent med_5 apn1 apt1)
   deleted: (at med_5 apt1)
   added: (in med_5 apn1)
   goals met: 8 of 16
124. (load-agent med_4 apn1 apt1)
   deleted: (at med_4 apt1)
   added: (in med_4 apn1)
   goals met: 8 of 16
125. (load-agent med_3 apn1 apt1)
   deleted: (at med_3 apt1)
   added: (in med_3 apn1)
   goals met: 8 of 16
126. (fly-agent apn1 apt1 apt2)
   deleted: (at apn1 apt1)
   added: (at apn1 apt2)
   goals met: 8 of 16
127. (unload-agent med_3 apn1 apt2)
   deleted: (in med_3 apn1)
   added: (at med_3 apt2)
   goals met: 8 of 16
128. (fly-agent apn1 apt2 apt4)
   deleted: (at apn1 apt2)
   added: (at apn1 apt4)
   goals met: 8 of 16
129. (unload-agent med_8 apn1 apt4)
   deleted: (in med_8 apn1)
   added: (at med_8 apt4)
   goals met: 8 of 16
130. (unload-agent med_5 apn1 apt4)
   deleted: (in med_5 apn1)
   added: (at med_5 apt4)
   goals met: 8 of 16
131. (fly-agent apn2 apt5 apt1)
   deleted: (at apn2 apt5)
   added: (at apn2 apt1)
   goals met: 8 of 16
132. (load-agent med_7 apn2 apt1)
   deleted: (at med_7 apt1)
   added: (in med_7 apn2)
   goals met: 8 of 16
133. (load-agent med_6 apn2 apt1)
   deleted: (at med_6 apt1)
   added: (in med_6 apn2)
   goals met: 8 of 16
134. (move-carrier c4 pos4 apt4 cit4)
   deleted: (at c4 pos4)
   added: (at c4 apt4)
   goals met: 8 of 16
135. (load-carrier med_3 c2 apt2)
   deleted: (at med_3 apt2)
   added: (in med_3 c2)
   goals met: 8 of 16
136. (move-carrier c2 apt2 pos2 cit2)
   deleted: (at c2 apt2)
   added: (at c2 pos2)
   goals met: 8 of 16
137. (unload-carrier med_3 c2 pos2)
   deleted: (in med_3 c2)
   added: (at med_3 pos2)
   goals met: 9 of 16
138. (fly-agent apn2 apt1 apt2)
   deleted: (at apn2 apt1)
   added: (at apn2 apt2)
   goals met: 9 of 16
139. (fly-agent apn1 apt4 apt3)
   deleted: (at apn1 apt4)
   added: (at apn1 apt3)
   goals met: 9 of 16
140. (unload-agent med_4 apn1 apt3)
   deleted: (in med_4 apn1)
   added: (at med_4 apt3)
   goals met: 9 of 16
141. (fly-agent apn2 apt2 apt5)
   deleted: (at apn2 apt2)
   added: (at apn2 apt5)
   goals met: 9 of 16
142. (unload-agent med_7 apn2 apt5)
   deleted: (in med_7 apn2)
   added: (at med_7 apt5)
   goals met: 9 of 16
143. (unload-agent med_6 apn2 apt5)
   deleted: (in med_6 apn2)
   added: (at med_6 apt5)
   goals met: 9 of 16
144. (move-carrier c3 pos3 apt3 cit3)
   deleted: (at c3 pos3)
   added: (at c3 apt3)
   goals met: 9 of 16
145. (move-carrier c2 pos2 apt2 cit2)
   deleted: (at c2 pos2)
   added: (at c2 apt2)
   goals met: 9 of 16
146. (load-carrier med_4 c3 apt3)
   deleted: (at med_4 apt3)
   added: (in med_4 c3)
   goals met: 9 of 16
147. (load-carrier med_8 c4 apt4)
   deleted: (at med_8 apt4)
   added: (in med_8 c4)
   goals met: 9 of 16
148. (move-carrier c4 apt4 pos4 cit4)
   deleted: (at c4 apt4)
   added: (at c4 pos4)
   goals met: 9 of 16
149. (unload-carrier med_8 c4 pos4)
   deleted: (in med_8 c4)
   added: (at med_8 pos4)
   goals met: 10 of 16
150. (move-carrier c3 apt3 pos3 cit3)
   deleted: (at c3 apt3)
   added: (at c3 pos3)
   goals met: 10 of 16
151. (unload-carrier med_4 c3 pos3)
   deleted: (in med_4 c3)
   added: (at med_4 pos3)
   goals met: 11 of 16
152. (fly-agent apn1 apt3 apt1)
   deleted: (at apn1 apt3)
   added: (at apn1 apt1)
   goals met: 11 of 16
153. (fly-agent apn1 apt1 apt2)
   deleted: (at apn1 apt1)
   added: (at apn1 apt2)
   goals met: 11 of 16
154. (move-carrier c4 pos4 apt4 cit4)
   deleted: (at c4 pos4)
   added: (at c4 apt4)
   goals met: 11 of 16
155. (move-carrier c2 apt2 pos2 cit2)
   deleted: (at c2 apt2)
   added: (at c2 pos2)
   goals met: 11 of 16
156. (load-carrier med_7 c5 apt5)
   deleted: (at med_7 apt5)
   added: (in med_7 c5)
   goals met: 11 of 16
157. (move-carrier c5 apt5 pos5 cit5)
   deleted: (at c5 apt5)
   added: (at c5 pos5)
   goals met: 11 of 16
158. (unload-carrier med_7 c5 pos5)
   deleted: (in med_7 c5)
   added: (at med_7 pos5)
   goals met: 12 of 16
159. (fly-agent apn1 apt2 apt1)
   deleted: (at apn1 apt2)
   added: (at apn1 apt1)
   goals met: 12 of 16
160. (load-agent med_2 apn1 apt1)
   deleted: (at med_2 apt1)
   added: (in med_2 apn1)
   goals met: 12 of 16
161. (load-agent food_3 apn1 apt1)
   deleted: (at food_3 apt1)
   added: (in food_3 apn1)
   goals met: 12 of 16
162. (move-carrier c5 pos5 apt5 cit5)
   deleted: (at c5 pos5)
   added: (at c5 apt5)
   goals met: 12 of 16
163. (move-carrier c2 pos2 apt2 cit2)
   deleted: (at c2 pos2)
   added: (at c2 apt2)
   goals met: 12 of 16
164. (load-carrier med_5 c4 apt4)
   deleted: (at med_5 apt4)
   added: (in med_5 c4)
   goals met: 12 of 16
165. (move-carrier c4 apt4 pos4 cit4)
   deleted: (at c4 apt4)
   added: (at c4 pos4)
   goals met: 12 of 16
166. (unload-carrier med_5 c4 pos4)
   deleted: (in med_5 c4)
   added: (at med_5 pos4)
   goals met: 13 of 16
167. (fly-agent apn1 apt1 apt2)
   deleted: (at apn1 apt1)
   added: (at apn1 apt2)
   goals met: 13 of 16
168. (unload-agent med_2 apn1 apt2)
   deleted: (in med_2 apn1)
   added: (at med_2 apt2)
   goals met: 13 of 16
169. (unload-agent food_3 apn1 apt2)
   deleted: (in food_3 apn1)
   added: (at food_3 apt2)
   goals met: 13 of 16
170. (load-carrier med_2 c2 apt2)
   deleted: (at med_2 apt2)
   added: (in med_2 c2)
   goals met: 13 of 16
171. (move-carrier c2 apt2 pos2 cit2)
   deleted: (at c2 apt2)
   added: (at c2 pos2)
   goals met: 13 of 16
172. (unload-carrier med_2 c2 pos2)
   deleted: (in med_2 c2)
   added: (at med_2 pos2)
   goals met: 14 of 16
173. (load-carrier med_6 c5 apt5)
   deleted: (at med_6 apt5)
   added: (in med_6 c5)
   goals met: 14 of 16
174. (move-carrier c5 apt5 pos5 cit5)
   deleted: (at c5 apt5)
   added: (at c5 pos5)
   goals met: 14 of 16
175. (unload-carrier med_6 c5 pos5)
   deleted: (in med_6 c5)
   added: (at med_6 pos5)
   goals met: 15 of 16
176. (move-carrier c2 pos2 apt2 cit2)
   deleted: (at c2 pos2)
   added: (at c2 apt2)
   goals met: 15 of 16
177. (load-carrier food_3 c2 apt2)
   deleted: (at food_3 apt2)
   added: (in food_3 c2)
   goals met: 15 of 16
178. (move-carrier c2 apt2 pos2 cit2)
   deleted: (at c2 apt2)
   added: (at c2 pos2)
   goals met: 15 of 16
179. (unload-carrier food_3 c2 pos2)
   deleted: (in food_3 c2)
   added: (at food_3 pos2)
   goals met: 16 of 16
